<a href="https://colab.research.google.com/github/Wonderingleon/Python/blob/main/TCD_Python_to_Excel_Titanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
import os
Dossier = os.getcwd()
Dossier

'C:\\Users\\perso'

In [ ]:
Titanic = pd.read_excel('titanic3 (3).xls')
Titanic.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [ ]:
pd.pivot_table(Titanic, index=['pclass'], values=['survived'], aggfunc=np.sum)

        survived
pclass
1            200
2            119
3            181

In [ ]:
TDC =pd.pivot_table(Titanic, index=['pclass'], columns=['sex'],values=['age','survived'], aggfunc={'age' :np.mean, 'survived': np.sum})

In [ ]:
TDC

              age            survived
sex        female       male   female male
pclass
1       37.037594  41.029250      139   61
2       27.499191  30.815401       94   25
3       22.185307  25.962273      106   75

In [ ]:
from pandas import ExcelWriter
Ecrire = pd.ExcelWriter('Titanic_1.xlsx')
Titanic.to_excel(Ecrire, sheet_name='x1')
TDC.to_excel(Ecrire, sheet_name='x2')
Ecrire.save()